       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
      *-------------------------------------------------------------------------
      * This is a simple COBOL Program to test your environment
      * Area A starts at Column 8, Area B starts at Column 12
      *-------------------------------------------------------------------------
       PROCEDURE DIVISION.
           DISPLAY "Hello, World".
           DISPLAY "Welcome to COBOL PROGRAMMING on Linux Mint".
           STOP RUN.
           