       IDENTIFICATION DIVISION.
       PROGRAM-ID. T2-Sub.

       DATA DIVISION.
       LINKAGE SECTION.
       01  LS-BIRTH-YEAR    PIC 9(04).
       01  LS-AGE           PIC 9(03).

       PROCEDURE DIVISION USING LS-BIRTH-YEAR, LS-AGE.
       000-CALC-LOGIC.
           COMPUTE LS-AGE = 2026 - LS-BIRTH-YEAR.
           EXIT PROGRAM.